notes/20250425-admonition-demo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Styling Org Callouts for the Site</title>
<meta name="description" content="Quick walkthrough of the site’s new callout styling and how to use it." />
<meta name="keywords" content="org-mode, admonitions, emacs site, publishing workflow" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/notes/20250425-admonition-demo.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/notes/20250425-admonition-demo.html">
<meta property="og:title" content="Styling Org Callouts for the Site">
<meta property="og:description" content="Quick walkthrough of the site’s new callout styling and how to use it.">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2025-09-20T00:00:00Z">
<meta property="article:modified_time" content="2026-07-05T21:40:10Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Styling Org Callouts for the Site">
<meta name="twitter:description" content="Quick walkthrough of the site’s new callout styling and how to use it.">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <div class="site-header__right">
    <nav class="topnav-links" aria-label="Primary">
      <a href="/archive.html">Blog</a>
      <a href="/about.html">About Me</a>
      <a href="/notes.html">Notes</a>
      <a href="/rss.xml">RSS</a>
    </nav>
    <button id="theme-toggle" class="nav-theme-toggle" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </div>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Styling Org Callouts for the Site</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1979e18">Why</a></li>
<li><a href="#org06e9987">Examples</a>
<ul>
<li><a href="#org628f26e">Note</a></li>
<li><a href="#org2317312">Tip</a></li>
<li><a href="#orgd82fb45">Warning</a></li>
</ul>
</li>
<li><a href="#orga73945f">How it Works</a></li>
<li><a href="#org1c110eb">Using It</a></li>
</ul>
</div>
</nav>
<div class="preview" id="orgfcd4b02">
<p>
Quick walkthrough of the site’s new callout styling for Org blocks: see the raw markup, the rendered result, and the tiny bit of CSS/JS that makes it work.
</p>

</div>

<div id="outline-container-org1979e18" class="outline-2">
<h2 id="org1979e18">Why</h2>
<div class="outline-text-2" id="text-org1979e18">
<p>
I keep reaching for Org special blocks (<code>#+begin_note</code>, <code>#+begin_warning</code>, etc.) when I want callouts. This update gives them a consistent look across light and dark themes without much effort.
</p>
</div>
</div>

<div id="outline-container-org06e9987" class="outline-2">
<h2 id="org06e9987">Examples</h2>
<div class="outline-text-2" id="text-org06e9987">
<p>
Each example shows the Org snippet first, followed by how it renders after export.
</p>
</div>

<div id="outline-container-org628f26e" class="outline-3">
<h3 id="org628f26e">Note</h3>
<div class="outline-text-3" id="text-org628f26e">
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-block-begin-line">#+begin_note
</span>Use notes for context or references that amplify the main text.
<span class="org-org-block-end-line">#+end_note</span>
</pre>
</div>

<div class="note" id="org23bbc28">
<p>
Use notes for context or references that amplify the main text.
</p>

</div>
</div>
</div>

<div id="outline-container-org2317312" class="outline-3">
<h3 id="org2317312">Tip</h3>
<div class="outline-text-3" id="text-org2317312">
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-block-begin-line">#+begin_tip
</span>Tips are great for quick wins, shortcuts, or &#8220;you might not know&#8221; details.
<span class="org-org-block-end-line">#+end_tip</span>
</pre>
</div>

<div class="tip" id="org252cea5">
<p>
Tips are great for quick wins, shortcuts, or “you might not know” details.
</p>

</div>
</div>
</div>

<div id="outline-container-orgd82fb45" class="outline-3">
<h3 id="orgd82fb45">Warning</h3>
<div class="outline-text-3" id="text-orgd82fb45">
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-block-begin-line">#+begin_warning
</span>Warnings (and <span class="org-org-code">~#+begin_caution~</span> / <span class="org-org-code">~#+begin_important~</span>) announce risky steps or footguns.
<span class="org-org-block-end-line">#+end_warning</span>
</pre>
</div>

<div class="warning" id="org0ae2e8c">
<p>
Warnings (and <code>#+begin_caution</code> / <code>#+begin_important</code>) announce risky steps or footguns.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orga73945f" class="outline-2">
<h2 id="orga73945f">How it Works</h2>
<div class="outline-text-2" id="text-orga73945f">
<ul class="org-ul">
<li>Styling lives in <code>assets/orgstyle.css</code> (<code>.admonition</code>, <code>.admonition--warn</code>, etc.).</li>
<li>A tiny helper script <code>assets/admonitions.js</code> looks for exported <code>&lt;div class="note"&gt;</code> style blocks and wraps them with a title, icon, and proper roles.</li>
<li>No extra Org boilerplate—write the block and the theme handles the rest.</li>
</ul>
</div>
</div>

<div id="outline-container-org1c110eb" class="outline-2">
<h2 id="org1c110eb">Using It</h2>
<div class="outline-text-2" id="text-org1c110eb">
<ol class="org-ol">
<li>Add a special block to your Org file, e.g. <code>#+begin_tip</code> … <code>#+end_tip</code>.</li>
<li>Run <code>./build.sh</code> so the helper script and CSS land in the generated HTML.</li>
<li>Preview the page in both themes to check contrast (the colors adapt automatically).</li>
</ol>

<p>
That’s it. Drop these into any post where a little extra emphasis helps the reader.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="site-footer"><span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span> <span class="topnav-divider" aria-hidden="true">&middot;</span> <a href="/rss.xml">RSS</a></div>
</div>
</body>
</html>
